perf/scenarios/metar.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
        publish-metrics:
          - type: statsd
            prefix: "artillery.publish_metrics."

  pool: 100 # All HTTP requests from all virtual users will be sent over the same connections

  variables:
    airportcode:
      - SAEZ
      - KDEN
      - EBCI
      - KDBQ
      - KGPT
      - KMCI
      - KMIA
      - SAAR
      - SARF
      - SARP
      - SAZM
      - SAZS
      - SCBA
      - SCFA
      - SCEL
      - SUAA
      - SULS
      - CYWG
      - AYPY
      - BIKF
      - BKPR
      - 0083
      - CYEG
      - CYHZ
      - CYOW
      - CYUL
      - CYVR
      - CYWG
      - CYYC
      - CYYJ
      - CYYT
      - CYYZ
      - DAAG
      - DFFD
      - DGAA
      - DNAA
      - DNAI
      - DNKN
      - DNMM
      - DRRN
      - DTTA
      - EBBR
      - EBCI
      - EBLG
      - EDDB
      - EDDC
      - EDDF
      - EDDG
      - EDDH
      - EDDK
      - EDDL
      - EDDM
      - EDDN
      - EDDP
      - EDDS
      - EDDT
      - EDDV
      - EDDW
      - EDLW
      - EDSB
    
  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 20
    - name: Plain
      duration: 180
      arrivalRate: 20
    - name: Stress
      duration: 120
      arrivalRate: 5
      rampTo: 200

scenarios:
  - nane: Test Metar Baseline
    flow:
      - get:
          url: '/metar?station={{ airportcode }}'